#Область СобытияЭлементовФормы

&НаСервере
Функция ПолучитьURLЛоготипа()
	
	Возврат асд_ОсновнойМодульСервер.ПолучитьURLЛоготипа();
	
КонецФункции

&НаКлиенте
Процедура ТекстАСДНажатие(Элемент)
	
	ПерейтиПоНавигационнойСсылке(ПолучитьURLЛоготипа());
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументРезультатОтборПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(ОбъектРезультатОтбор) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ОбъектРезультат", ОбъектРезультатОтбор, , , Истина);
	Иначе	
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ОбъектРезультат", "", , , Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументОснованиеОтборПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(ОбъектОснованиеОтбор) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ОбъектОснование", ОбъектОснованиеОтбор, , , Истина);
	Иначе	
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ОбъектОснование", "", , , Ложь);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
  
