#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция ЕстьНеобработанныеОшибкиВЖурнале()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|   ИдентификаторЗаписи
	|ИЗ
	|	РегистрСведений.асд_ЖурналОшибок	
	|ГДЕ
	|	Обработана = Ложь
	|";
	
	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если НЕ Отказ Тогда
		
		ТаблицаЗаписей = ЭтотОбъект.Выгрузить();
		ЗаписиСОшибками = ТаблицаЗаписей.НайтиСтроки(Новый Структура("Обработана", Ложь));
		
		Если ЗаписиСОшибками.Количество() ИЛИ ЕстьНеобработанныеОшибкиВЖурнале() Тогда
			
			ПараметрыПроцедуры = Новый Массив;
			
		    ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
			ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Обработка ошибок АСД'");
			
			ДлительныеОперации.ВыполнитьВФоне("асд_ОсновнойМодульСервер.ОбработатьОшибки", ПараметрыПроцедуры, ПараметрыВыполнения);
				
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#КонецЕсли